init(1)
require "TSLib"
require "yyxlib"
require "FZ_UI"



APPID = "com.tencent.lycqsh"


local whitelist = "0123456789/()" --数字

--FindColorByMultiPoint通过多点找色，简称 FCBMP 
FCBMP = {
	["授权登陆界面"] = {
	{  155,   57, 0x8e1a15},
	{  174,   76, 0x971411},
	{  117,   87, 0x971411},
	{  117,  144, 0x961411},
	{  163,  154, 0x971411},
	{  514,  740, 0x65b6b2},
	{  614,  739, 0x75bebe},
	{ 1232,  757, 0x1d1d1d},
	{ 1261,  761, 0x161715},
},
["确定进入游戏"]= {
	{ 1519,  964, 0x770d0c},
	{ 1537,  977, 0xf9f5b5},
	{ 1534,  988, 0xf6f587},
	{ 1528,  996, 0x7b150d},
	{ 1564,  994, 0x761010},
	{ 1590,  984, 0x6b1810},
	{ 1590,  980, 0xfcf8bd},
	{ 1615,  985, 0x792302},
	{ 1504, 1000, 0xeeaa55},
	{ 1500,  997, 0xf0bd8a},
	{ 1500,  980, 0x977553},
	{ 1500,  957, 0xa17f5d},
	{ 1535,  949, 0x9d7b5f},
	{ 1775,  990, 0xc17f46},
	{ 1774,  972, 0x9f7252},
	{ 1767,  949, 0xa28063},
},
["进入游戏进度条"] = {
	{  262,  992, 0xe8d793},
	{  271,  992, 0xfffad8},
	{  298,  968, 0xd9b773},
	{  299, 1017, 0xb79a76},
	{  361, 1009, 0x927232},
	{  406, 1009, 0x9f7e30},
	{  406,  977, 0xc8b764},
	{ 1607,  972, 0xffe6b3},
	{ 1649,  991, 0xfff5d3},	
	{  423,  977, 0xc8b764},
	{  686,  977, 0xc5b468},
	{  932,  977, 0xcdbc7a},
	{ 1402,  977, 0xc7b674},
	{  392, 1009, 0x9f7e30},
	{  919, 1009, 0xa58436},
	{ 1403, 1009, 0xa28133},

},
	["挑战BOSS界面"] = {
	{  283,   73, 0x774433},
	{  307,   75, 0xfada61},
	{  332,   76, 0xffe65e},
	{  355,   76, 0x4e2311},
	{  441,   84, 0x3d0f02},
	{  542,   85, 0xb08e44},
	{ 1598,   82, 0xfdfcad},
},
["蓝月城"] = {
	{ 1753,   29, 0x9e6e4e},
	{ 1758,   37, 0x443424},
	{ 1759,   43, 0xfbfafa},
	{ 1759,   47, 0xffffff},
	{ 1755,   51, 0xd5cfcb},
	{ 1757,   67, 0x835a24},
	{ 1794,   65, 0xfdfcfb},
	{ 1831,   52, 0x4e3620},
	{ 1753,   52, 0x523a26},
},
["青石城"] = {
	{ 1759,   29, 0xa77554},
	{ 1791,   29, 0xa77554},
	{ 1780,   44, 0xf7f6f5},
	{ 1801,   44, 0xf7f6f5},
	{ 1786,   50, 0xf1efee},
	{ 1780,   56, 0xf9f8f7},
	{ 1787,   56, 0x614827},
	{ 1796,   55, 0x5a4227},
	{ 1799,   56, 0xfbfaf9},
},

["禁魔城"] = {
	{ 1759,   29, 0xa77554},
	{ 1778,   29, 0xa77554},
	{ 1809,   29, 0xa77554},
	{ 1756,   44, 0x5c4537},
	{ 1758,   44, 0xebe8e6},
	{ 1760,   44, 0x4d3424},
	{ 1769,   44, 0xfbfbfb},
	{ 1791,   43, 0xf8f7f6},
	{ 1761,   61, 0x694924},
}, 
	["活动界面"] = {
	{  270,   14, 0xf6d476},
	{  353,   44, 0xfff7be},
	{  422,   48, 0xffee88},
	{  445,   47, 0xfff1ad},
	{  458,   67, 0xf6e56e},
	{  618,   66, 0xfff2cf},
},

	["万魔殿地图"] = {
	{ 1724,   29, 0xa77554},
	{ 1742,   29, 0xa77554},
	{ 1734,   29, 0xa47251},
	{ 1733,   44, 0xefedeb},
	{ 1739,   44, 0xefedec},
	{ 1759,   44, 0xf2f0ef},
	{ 1763,   44, 0xfbfbfa},
	{ 1768,   44, 0xf2f0ef},
},

	["贵族专属挂机"] = {
	{ 1710,   29, 0xa77554},
	{ 1710,   32, 0x2e1e18},
	{ 1716,   43, 0xf2f0ef},
	{ 1716,   52, 0xfefefe},
	{ 1727,   52, 0xe8e4e1},
	{ 1780,   51, 0xf6f5f4},
	{ 1828,   52, 0xfefefe},
	{ 1858,   64, 0xffffff},
},
	["角色血量状态良好"] = {
	{ 1587,  424, 0x8e1604},
	{ 1585,  424, 0x8e1604},
	{ 1583,  424, 0x8e1604},
	{ 1579,  424, 0x8e1604},
	{ 1582,  423, 0x9e1d0c},
	{ 1580,  423, 0x9e1d0c},
},
["角色血量一般"] = {
	{  590,  954, 0xf61138},
	{  631,  957, 0xff1638},
	{  638,  957, 0xff1448},
	{  647,  959, 0xf01232},
}
,
["角色血量状态一般"] = {
	{ 1524,  425, 0x8e1604},
	{ 1522,  425, 0x8e1604},
	{ 1531,  425, 0x8e1604},
	{ 1531,  424, 0x8e1604},
	{ 1529,  424, 0x8e1604},
	{ 1526,  424, 0x8e1604},
},["角色血量状态过低"] ={
	{ 1308,  424, 0x8e1604},
	{ 1310,  424, 0x8e1604},
	{ 1313,  424, 0x8e1604},
},
["自动战斗"] = {
	{ 1833,  505, 0x332222},
	{ 1827,  519, 0xfefeaa},
	{ 1840,  531, 0x281f1a},
	{ 1869,  519, 0xe0cf8b},
	{ 1845,  542, 0x2a1f1b},
	{ 1833,  553, 0x94733a},
	{ 1818,  571, 0x7f5d3b},
	{ 1877,  567, 0xd6b470},
},
["锁定怪物"] = {
	{  720,   59, 0xa1906e},
	{  736,   60, 0x271b0e},
	{  753,   62, 0xe5d480},
	{  761,   61, 0x332514},
	{  773,   67, 0xc4a261},
	{  787,   60, 0x322414},
	{  798,   60, 0x291d0e},
	{  805,   60, 0x23170a},
},
["背包满"] = {
	{ 1551,  290, 0x00f800},
	{ 1546,  293, 0x00f601},
	{ 1565,  293, 0x00f601},
	{ 1600,  294, 0x00ff00},
	{ 1609,  296, 0x00f301},
	{ 1682,  294, 0xffffff},
	{ 1687,  288, 0xfefefe},
},
["背包满1"] = {
	{ 1775,  341, 0x301705},
	{ 1786,  342, 0x301707},
	{ 1799,  360, 0x301707},
	{ 1759,  362, 0x301703},
	{ 1780,  380, 0x2d1c00},
	{ 1789,  379, 0x352408},
},
["快捷物品栏"] = {
	{ 1837,  252, 0xeee89f},
	{ 1838,  259, 0xe6d573},
	{ 1847,  263, 0xfafaba},
	{ 1853,  274, 0xf8f084},
	{ 1862,  280, 0xf4f4d2},
	{ 1854,  293, 0x886434},
	{ 1842,  307, 0x997847},
	{ 1825,  283, 0x865e2c},
},
["回收收益上限"] = {

	{  973,  437, 0xffc300},
	{ 1135,  425, 0xffc300},
	
	{ 1223,  432, 0xffc300},
	
	{  818,  630, 0xfef7b8},
	{  825,  630, 0xfef7b8},
	{  870,  624, 0x6f3a30},
	{ 1032,  622, 0x683930},
	{ 1050,  622, 0x6a3930},


	
},
["展开活动按钮"] ={
	{ 1482,   84, 0xeadccb},
	{ 1483,   90, 0xfddfac},
	{ 1491,   88, 0xeedeba},
	{ 1513,   85, 0xfbeccf},
	{ 1560,   95, 0xeecfa1},
	{ 1636,   82, 0xffff99},
	{ 1641,   82, 0xffff9e},
	{ 1641,   77, 0xfffe9f},
},
["五级囚犯"] = {
	{ 1403,  151, 0xfcc941},
	{ 1545,  151, 0xf5cc40},
	{ 1685,  151, 0xfcc941},
	{ 1404,  407, 0xfcc941},
	{ 1686,  446, 0xfcc941},
	{ 1404,  234, 0xfcc941},
},
["领取押运奖励"] = {
	{  940,  338, 0xf5631c},
	{  974,  337, 0xf1601b},
	{  995,  339, 0xf9621c},
	{ 1021,  337, 0xe6561c},
	{  780,  619, 0xfef7b8},
	{  785,  633, 0xfff8b9},
},
["活动退出面板展开"] = {
	{   29,  622, 0xdfcca7},
	{   29,  634, 0xccc3a1},
	{   29,  645, 0xe0deb8},
	{   29,  656, 0xf7f7a8},
	{   12,  641, 0xbaa954},
	{   12,  635, 0x82603e},
	{   24,  638, 0x3c210c},
},
["进入下一层界面"] = {
	{  903,   93, 0xfcf5b2},
	{  904,  110, 0xffe570},
	{  917,  134, 0xf4c14a},
	{ 1185,  127, 0xf9f9ac},
	{  903,  839, 0x693636},
	{ 1027,  838, 0x693636},
	{  889,  886, 0x6d1407},
	{ 1033,  882, 0x6d1407},
},

["退出混沌魔域"] = {
	{  240,  289, 0xc36010},
	{  191,  295, 0xfce2a2},
	{  218,  295, 0xfce2a2},
	{  227,  298, 0xfce1a2},
	{  255,  296, 0xfbe0a0},
	{  284,  303, 0xfee4a4},
	{  211,  565, 0xebdda6},
	{  213,  571, 0x7d3c30},
	{  213,  558, 0x592615},
	{  283,  569, 0x803d30},
	{  273,  567, 0xf8eeb2},
	{  303,  569, 0xfcf3b5},
	{  312,  569, 0xfff8b9},

},
["退出金猪活动"] = {
	{  228,  287, 0xb55e17},
	{  227,  295, 0xf0b227},
	{  237,  296, 0xf5b729},
	{  263,  296, 0xfbbd2a},
	{  288,  316, 0xfabc2a},
	{  219,  565, 0xfdf5b7},
	{  230,  565, 0xfdf5b7},
	{  255,  564, 0xfbf2b5},
},
["混沌魔域地图"] = {
	{  499,  145, 0xf9eed2},
	{  500,  151, 0xfcea95},
	{  528,  151, 0xffee88},
	{  523,  180, 0x5d2305},
	{  587,  194, 0xffde46},
	{  547,  210, 0xff9003},
	{  547,  223, 0x201305},
},


["行会心魔召唤"] = {
	{  632,  331, 0xe9d8b6},
	{ 1287,  331, 0xf8f3c0},
	{ 1013,  365, 0xf4e373},
	{  845,  615, 0xbc783b},
	{  768,  642, 0xa4824f},
	{  853,  651, 0xebdda3},
	{ 1004,  641, 0x9b7b4f},
	{ 1072,  615, 0xb57539},
	{ 1151,  641, 0xa4824f},
	{ 1091,  643, 0xf5e9ad},
},
["行会心魔召唤1"] = {
	{  888,  360, 0xfce391},
	{  900,  360, 0xfae983},
	{  932,  360, 0xffee88},
	{  819,  630, 0xfef7b8},
	{  826,  650, 0xf1e6aa},
	{  834,  645, 0xfff8b9},
	{  846,  647, 0xf9eeb1},
	{  863,  645, 0xf1dfa4},
	{ 1246,  363, 0xfff48e},
},

["服务器断线"] = {
	{  948,  351, 0xead588},
	{  983,  354, 0xffeb8b},
	{  858,  471, 0xe4ecec},
	{  893,  485, 0xe4ecec},
	{  975,  487, 0xe4ecec},
	{ 1005,  489, 0xe4ecec},
	{  936,  602, 0xf5d89b},
	{  974,  600, 0xf3d599},
	{  974,  611, 0xfee4a4},
},
["进入游戏界面"] = {
	{ 1080,  817, 0x53eb2b},
	{ 1089,  817, 0x53ea2b},
	{ 1127,  817, 0x58e82e},
	{ 1152,  817, 0x55d029},
	{  921,  944, 0xfdfbf5},
},
["弹出挂机界面"] = {
	{ 1627,   45, 0xf6e597},
	{ 1639,   45, 0xe5ce76},
	{ 1746,   98, 0xead7a1},
	{ 1661,   86, 0xfefeb6},
	{ 1370,  159, 0xf7ca52},
	{ 1386,  159, 0xf8cb52},
	{ 1416,  159, 0xfccf54},
	{ 1436,  159, 0xf3c650},
},
["膜拜城主"] = {
	{  927,   95, 0xf8f69b},
	{  943,   87, 0xfaf795},
	{  347,  145, 0xf9e8c1},
	{ 1342,  241, 0x4dd329},
	{ 1088,  119, 0xf4e368},
	{ 1577,  129, 0xf2f2ac},
	{ 1404,  260, 0x53eb2b},
	{ 1001,  105, 0xffee88},
},
["膜拜城主10级奖励"] = {
	{ 1558,  634, 0x0f0c0e},
	{ 1579,  633, 0x0f0c0b},
	{ 1551,  687, 0x0f0b0d},
	{ 1568,  687, 0x0d0a0a},
},
["尸魔地牢地图"] = {
	{  797,  151, 0xc99733},
	{  822,  151, 0xc59c38},
	{  743,  170, 0xe5ce98},
	{  734,  172, 0xfeecc7},
	{  735,  210, 0xd98d2f},
	{  722,  727, 0x7e6f4f},
	{  712,  776, 0xb09766},
},
["回城石图标灭"] = {
	{ 1620,  273, 0x494949},
	{ 1605,  280, 0x454545},
	{ 1607,  287, 0xdbdbdb},
	{ 1641,  287, 0x373737},
	{ 1634,  247, 0xd1d1d1},
	{ 1619,  283, 0xe3e3e3},
},
["随机石图标"] = {
	{ 1736,  268, 0xedcb69},
	{ 1738,  270, 0xefda45},
	{ 1740,  272, 0xf3e239},
	{ 1729,  274, 0xf9d63e},
	{ 1720,  286, 0xfbfb40},
	{ 1744,  282, 0xfff53a},
	{ 1730,  279, 0xa49382},
	{ 1739,  279, 0x998888},
},
["英雄护盾状态一般"] = {
	{  660,  104, 0xe8961f},
	{  662,  104, 0xf19e20},
	{  664,  104, 0xf19e20},
	{  666,  104, 0xf19e20},
	{  660,  103, 0xe2931f},
	{  662,  103, 0xed9c20},
	{  664,  103, 0xed9c20},
},
["英雄护盾状态过低"] = {
	{  645,  133, 0xfba720},
	{  647,  133, 0xffae20},
	{  649,  133, 0xffb420},
	{  651,  133, 0xffb720},
	{  650,  134, 0xffb420},
	{  648,  134, 0xffb020},
	{  646,  134, 0xfeab20},
},
["英雄抗状态"] = {
	{  571,  151, 0xefedbd},
	{  587,  148, 0x7e0c00},
	{  589,  144, 0xf0dbac},
	{  597,  146, 0x7d0d01},
	{  624,  150, 0xf8f8dd},
	{  607,  152, 0x650901},
	{  586,  164, 0x601004},
	{  597,  162, 0xb00b00},
},
["玩家PK按钮"] = {
	{ 1811,  810, 0x109dec},
	{ 1831,  802, 0xaad4d4},
	{ 1838,  804, 0x87daeb},
	{ 1846,  807, 0x55ccee},
	{ 1854,  807, 0x70c5e7},
	{ 1851,  816, 0x1a9ae9},
	{ 1851,  822, 0x3499f0},
},
["玩家PK按钮设置打勾"] = {
	{  388,  745, 0xf1bf3b},
	{  391,  748, 0xdaa72c},
	{  396,  754, 0xb05b00},
	{  401,  758, 0xa44703},
	{  419,  738, 0xf0c02b},
	{  424,  734, 0xfecb32},
	{  427,  731, 0xfac831},
	{  429,  730, 0xe7c039},
},
["传送仓库管理员"] = {
	{  887,  544, 0x00fe3c},
	{  896,  545, 0x05e338},
	{  906,  544, 0x01f93b},
	{  924,  543, 0x01f73b},
	{  933,  543, 0x03eb39},
	{  951,  543, 0x01fc3b},
	{ 1038,  543, 0x00ff3c},
	{ 1060,  544, 0x01f83b},
	{ 1074,  544, 0x02f23a},
},
["关闭角色面板"] = {
	{ 1523,   57, 0xdcb845},
	{ 1527,   57, 0xdcb845},
	{ 1531,   57, 0xdcb845},
	{ 1535,   57, 0xdcb845},
	{ 1555,   79, 0xfaf9b2},
	{ 1564,   87, 0xfbfbaf},
	{ 1553,   98, 0xeede90},
},
["经验衰减屏蔽提示"] = {
	{ 1113,  938, 0xf2d329},
	{ 1117,  938, 0xeed228},
	{ 1120,  938, 0xe7d62c},
	{ 1111,  950, 0xcc5600},
	{ 1114,  950, 0xcc5600},
	{ 1119,  950, 0xcb5600},
},
["装备回收界面"] ={
	{ 1247,  882, 0xfee4a4},
	{ 1247,  890, 0xfee4a4},
	{ 1266,  882, 0xfbe2a2},
	{ 1266,  893, 0xfbe2a2},
	{ 1318,  895, 0xecd994},
	{ 1341,  884, 0xfce2a2},
	{ 1287,  659, 0xc15f10},
	{ 1317,  659, 0xbb5d11},
},
	
}

--TouchByPoint点击索引所对的坐标,简称 TBP
TBP = {
	["服务器断线"] = {  954,  613,},
	["获取角色状态"] = {{ 97,   94,800},{ 1717,  187,800}},
	["关闭角色面板"] =  {1563,   86, },
	["非贵族地图选择"] = {{  791,  346,},{ 1158,  354,},{ 1507,  361,},{ 1170,  510,},{ 1510,  511,},{ 1510,  511, },{  783,  600,},{ 1137,  600,},{ 1488,  600,}},
	["非贵族随机地图"] = {{  388,  370,},{  384,  473, },{  383,  586,},{  383,  670,}},
	["非贵族进入挂机"] = {{  791,  346,1000},{  944,  851, 500}},
	["授权登陆"] = {{ 1382,  761,1000},{ 1487,  480,2000},{ 1487,  480,2000},},
	["进入游戏"] = {  931,  968,},
	["确定进入游戏"] = { 1634,  982, },
	["领取挂机奖励"] =  {{ 1661,   88,800},{ 1069,  631,800},},
	["关闭贵族界面"] = { 1579,   96,},
	["挑战BOSS"] = {   1529,   21,},
	["活动界面"] = { 1386,  155,},
	["恢复血量"] = { 1670,  751,},
	["进入万魔殿"] = {{ 1753,  527,500},{ 1110,  946,3000},{  947,  883,500}},
	["进入贵族挂机"] = {{ 1760,  755,500},{ 1112,  960,500},},
	["自动战斗"] = { 1847,  550,},
	["随机石"] = { 1734,  277,},
	["回城石"] = { 1621,  284,},
	["前往回收"] = { 1594,  301},
	["经验衰减屏蔽提示"] = { 1116,  945,},
	["回收装备"] = {{ 1295,  887,800},{ 1182,  527,800},},
	["随身仓库"] = {  827,  863, },
	["关闭装备回收窗口"] = {{ 1530,  187,800},{ 1530,  187,800}},
	["整理背包"] = {  925,  773,},
	["传送仓库管理员"] = { 1056,  544,},
	["展开快捷物品"] = { 1846,  282,},
	["展开活动按钮"] = { 1646,   78, },
	["前往活动"] = { 1026,  242, },
	["回收收益上限"] = {{  906,  550,800},{   1060,  638, 800}},
	["活动退出面板展开"] = {   20,  636,},
	["切换英雄模式"] = {  592,  157,},
	["玩家PK按钮"] = { 1837,  810,},
	["玩家PK按钮设置打勾"] = {  407,  739,},
	["个人设置面板"] = { 1872,  181, },
	["关闭个人设置面板"] = { 1480,  165,},
	--活动部分
		--心魔召唤
		["进入心魔召唤"] = {  1074,  640,},
		["不进入心魔召唤"] = {   841,  635,},
		["退出心魔活动"] =  { 244,  579,},
		--世界BOSS
		["世界Boss"] = {  969,  930,},
		["退出世界Boss"] = { 244,  579,},
		["世界Boss金币鼓舞"] = {  682,  821,},
		--激情闭关
		["激情闭关"] = {  969,  930,},
		--押运囚犯
		["押运囚犯"] = {  956,  847, },
		["刷新囚犯"] = {  806,  978,},
		["开始押运"] = { 1567,  973,},
		["领取押运奖励"] = {  834,  617,},
		--金猪送礼
		["金猪送礼"] = {    939,  934,},
		["退出金猪活动"] = { 244,  579,},
		--混沌魔域
		["混沌魔域"] = {  955,  931,},
		["混沌魔域地图"] = { 1776,   51,},
		["关闭混沌魔域地图"] = { 1584,  183,},
		["进入下一层"] = {  327,  570,},
		["确定进入下一层"]= {  964,  852,},
		["退出混沌魔域"] = {{  266,  572,500},{ 1081,  645,500},},
		--尸魔地牢
		["尸魔地牢"] = {  955,  931,},
		["尸魔地牢地图"] =  { 1776,   51,},
		["进入尸魔二层"] = { 1013,  704,},
		["关闭尸魔地图"] = { 1584,  183,},
		["退出尸魔"] = {  244,  565,},
		--膜拜城主
		["刷新拥护等级"] = { 1470,  828,},
		["拥护"] = { 1438,  554,},

}



--游戏活动时间表
--task_time = 每天参加的次数
local _活动时间表 = {
	["押运囚犯"] = {{hour=10,min=30,},{hour=18,min=30,}},
	["金猪送礼"] = {{hour=11,min=30},{hour=15,min=0}},
	["混沌魔域"] = {{hour=14,min=0},{hour=22,min=0}},
	["尸魔地牢"] = {hour=16,min=0},
	["世界Boss"] = {hour=17,min=30},
	["激情闭关"] = {hour=18,min=0},
	["战夜封魔"] = {hour=19,min=30,onday="3,6,1"},--onday=每周2,5,7
	["珈蓝神殿"] = {hour=21,min=0,onday="2,6,1"},--onday=每周1,5,7
	["膜拜城主"] = {hour=12,min=0},
	}


--dialog("当前屏幕分辨率"..w.."X"..h, 5)
--找色范围,区域
AREA = {
	
	["任务范围"] = {
			X1=68,
			Y1=492,
			X2=130,
			Y2=627,
	
},
["地图范围"] = {
		X1 =  1682,  
		Y1 =   40,
		X2 = 1906, 
		Y2 =   70,
	
},
	["个人版面引导范围"] = {
			X1 = 36,  
			Y1 =40,
			X2 =1901, 
			Y2 = 1050,
		},
	["混沌魔域地图范围"] = {
			X1 =   493,  
			Y1 = 232,
			X2 =  1186, 
			Y2 = 890,
		
	},
	["混沌魔域剩余时间范围"] ={
			X1 =   296,  
			Y1 = 507,
			X2 =   327, 
			Y2 = 532,
	},
	["押运囚犯剩余次数范围"] = {
			X1 =  1057,
			Y1 =  757,
			X2 = 1088,
			Y2 = 787,
	},
	["怪物归属范围"] = {
		X1 =   861,   
		Y1 = 30,
		X2 =  1243,  
		Y2 =  64,
	},
	["贵族等级查询范围"] = {
		X1 = 56, 
		Y1 =  151, 
		X2 =  125,  
		Y2 =  177,
	},
	["玩家名称查询范围"] = {
			X1 =    420,
		Y1 =   155,
		X2 =  760,
		Y2 =    192, 
	},
	["断线提示查询范围"] = {
		X1 =  845,  
		Y1 = 465,
		X2 = 1121,
		Y2 =   498,
		
	},
	["回收时背包查询范围"] = {
		X1 =   383,  
		Y1 = 168,
		X2 =   961,  
		Y2 = 743,
	},
	["仓库时背包查询范围"] = {
		X1 =   353,  
		Y1 = 166,
		X2 =   939, 
		Y2 = 746,
	},
	
		 

}
--AreaRelativeFindColor  区域相对找色，简称 = ARFC
ARFC = {
	
	["混沌魔域BOSS"] = {
		color = 0xf0e07a,
		posandcolor ="10|0|0xfae972,10|4|0xfdec75,0|4|0xc89540,3|1|0x5c3a15,5|1|0x563513,6|2|0x4e2f14,3|3|0x4e3018",
	},
	["狂风碎片图标"] = {
		color = 0xe718ee,
		posandcolor = "-2|3|0xee11ee,5|3|0xffecff,5|7|0xf9ddf9,28|-28|0xf1c2ff,38|-6|0xf89df8",
	},
	
	
}




function _登入游戏()
		
while (true) do
	::LOGIN_LOOP::
	
	if (_多点找色(FCBMP.授权登陆界面))then
		mSleep(500)
		_点击(TBP.授权登陆)
	end
	if(_多点找色(FCBMP.进入游戏界面))then
		_点击(TBP.进入游戏)
	end
	if (_多点找色(FCBMP.确定进入游戏)) then
		_点击(TBP.确定进入游戏)

	end
	if (_多点找色(FCBMP.进入游戏进度条)) then
		local login_yc = 0
		local yc_times = 30 --三十秒重新启动游戏
		mSleep(200)
		repeat
			
			if (login_yc >= yc_times) then
				--登陆异常处理
				login_yc = 0
				--重新启动游戏
				closeApp(APPID);
				mSleep(3000)
				runApp(APPID);
				goto LOGIN_LOOP
				break
			end
			mSleep(1000)
			login_yc = login_yc + 1 
			
		until(_多点找色(FCBMP.进入游戏进度条) == false)
			mSleep(2500)
		if _多点找色(FCBMP.弹出挂机界面)then
			_点击(TBP.领取挂机奖励)
			mSleep(500)
		end
		break
	end
end
end

function _初始化()
repeat
	local flag = appIsRunning(APPID); --检测
	if flag  == 0 then  
		dialog("先进入游戏后再运行辅助！")
		runApp(APPID) 
		mSleep(3000)
		_登入游戏()
		mSleep(3000)
	else
		break
	end
until (flag == 1)
flag,msg = switchApp(APPID)
if flag then
    _debug("欢迎使用蓝月神奇助手挂机版！")
else
    dialog(msg)
end
end




_断线重连 = coroutine.create(function ()
while (true) do
	if _多点找色(FCBMP.服务器断线)then
		mSleep(1000)
		if (断线提示 == "与服务器断开连接")then
			_点击(TBP.服务器断线)
			mSleep(10*60*1000)
			_登入游戏()
			mSleep(3000)
		end
	end
	coroutine.yield()
end
end)



--自动战斗
_自动战斗 = coroutine.create(function ()
while (true) do
	if _多点找色(FCBMP.自动战斗) then
		_点击(TBP.自动战斗)
	end
	
	coroutine.yield()
end
end)



_玩家PK = coroutine.create(function (PK)
	PK = PK or "0"
while (true) do
	
	if (PK == "1" and _多点找色(FCBMP.万魔殿地图))then
		_点击(TBP.玩家PK按钮)
	end
	PK = coroutine.yield(PK)
end
end)

function _获取角色状态()
	mSleep(800)
	 _点击(TBP.获取角色状态)
	mSleep(800)

	if(_多点找色(FCBMP.角色血量状态一般) == false and _多点找色(FCBMP.角色血量状态过低) == false)then
		_点击(TBP.关闭角色面板)
		return 3
	end
	if(_多点找色(FCBMP.角色血量状态一般) == false and _多点找色(FCBMP.角色血量状态过低))then
		_点击(TBP.关闭角色面板)
		return 2
	end
	if  _多点找色(FCBMP.角色血量状态良好) then
		_点击(TBP.关闭角色面板)
		return 1
	end
	_点击(TBP.关闭角色面板)
	return 1
end

--获取贵族等级
function _获取当前贵族等级()
	mSleep(1000)
	_点击({    95,  163,})
	mSleep(2000)
	text = ocrText( 485,  880,   538,  947,0 , whitelist, 0)
	gzlevel = tonumber(text) - 1
	_debug("用户当前贵族等级为"..gzlevel, 3)
	mSleep(2000)
	_点击(TBP.关闭贵族界面)
	mSleep(3000)
	return gzlevel
end






_行会心魔召唤 = coroutine.create(function ()
while (true) do
		if _多点找色(FCBMP.行会心魔召唤) or _多点找色(FCBMP.行会心魔召唤1)then
			mSleep(1000)
			_点击(TBP.不进入心魔召唤)
		end
		coroutine.yield()
end
end)


function _狂风入库(贵族等级)
	_点击(TBP.整理背包)
	mSleep(1000)
	local x,y = _区域多点找色( ARFC.狂风碎片图标,AREA.回收时背包查询范围,90)
	if (x < 0) then
		_点击(TBP.关闭装备回收窗口)
		return
	end
	_点击(TBP.随身仓库)
	mSleep(800)
	if ((贵族等级 < 3) or (_多点找色(FCBMP.传送仓库管理员)))then
		_点击(TBP.传送仓库管理员)
		mSleep(1200)
	end
	
	x,y = _区域多点找色( ARFC.狂风碎片图标,AREA.仓库时背包查询范围,90)
	if (x > 0) then
		_点击({{x,y,800},{ 1292,  678,800},{ 1050,  980, 500}})
	end
	
end

function _进入野外地图()
			
		repeat
				_点击(TBP.挑战BOSS)
				mSleep(1500)
			until (_多点找色(FCBMP.挑战BOSS界面))
				mSleep(800)
				    --随机地图选择
					_点击({  283,  169,});
					mSleep(800)
					math.randomseed(os.time())
					mapseed = math.random(1,4)
					if (mapseed == 1)then
						randomseed = math.random(1,8)
						mSleep(200)
						_点击(TBP.非贵族地图选择[randomseed])
					else
						_点击(TBP.非贵族随机地图[mapseed])
						mSleep(1000)
						_点击(TBP.非贵族进入挂机)
					end
			
			
end
--角色背包满后进行物品回收换取经验和金币
_背包满回收 = coroutine.create(function (map,贵族等级)
	map = map or 0
	while (true) do
	if (_多点找色(FCBMP.背包满) or _多点找色(FCBMP.背包满1))then 
			mSleep(200)
			_点击(TBP.前往回收)
			mSleep(2500)
			if _多点找色(FCBMP.装备回收界面) and (_多点找色(FCBMP.经验衰减屏蔽提示) == false)then
				mSleep(500)
				_点击(TBP.经验衰减屏蔽提示) 
				mSleep(800)
			end

			_点击(TBP.回收装备)
			
			coroutine.resume(_回收收益上限)
			if (map < 1)then
				mSleep(500)
				_狂风入库(贵族等级)
			else
			mSleep(500)
			_点击(TBP.关闭装备回收窗口)
			end
			
	
	end
	coroutine.yield()
end
end)




--回血技能
_角色状态恢复 = coroutine.create(function ()
while (true) do
	if (_多点找色(FCBMP.角色血量一般) == false) then
		_点击(TBP.恢复血量)
	end
	coroutine.yield()
end
	
end)



function _使用随机石()
	if (_多点找色(FCBMP.快捷物品栏) == false) then
		_点击(TBP.展开快捷物品)
		mSleep(800)
	end

	_点击(TBP.随机石)
end
--角色回城
function _角色回城()
			mSleep(200)
		if (_多点找色(FCBMP.快捷物品栏) == false) then
			_点击(TBP.展开快捷物品)
			mSleep(800)
		end
		if(_多点找色(FCBMP.回城石图标灭))then
			_点击(TBP.回城石)
			mSleep(400)
			_点击(TBP.回城石)
		else
			_点击(TBP.回城石)
		end
end

--英雄和角色之间相互分担怪物伤害。避免角色血量过低、死亡、回城等，提高刷怪效率！
_角色换抗 = coroutine.create(function ()
while (true) do
	
	if  (_多点找色(FCBMP.英雄抗状态)) and (_多点找色(FCBMP.英雄护盾状态过低) == false)then
		_点击(TBP.切换英雄模式)
	end
	if (_多点找色(FCBMP.英雄护盾状态一般)) and ((_多点找色(FCBMP.英雄抗状态)) == false)then
		_点击(TBP.切换英雄模式)
	end
	coroutine.yield()
end

end)

--低血回城
_角色低血回城 = coroutine.create(function ()
while (true) do
	local 角色血量 = _获取角色状态()
	if (角色血量 == 3) then
		_角色回城()	
	end
	coroutine.yield()
end
	
end)
--回收收益上限
_回收收益上限 = coroutine.create(function ()
while (true) do
	if _多点找色(FCBMP.回收收益上限)then
		_点击(TBP.回收收益上限)
	end
	coroutine.yield()
end
	
end)

_购买回城石 = coroutine.create(function ()
while (true) do
	if (_多点找色(FCBMP.快捷物品栏) and _多点找色(FCBMP.回城石图标灭)) then
			_点击(TBP.回城石)
	end
	coroutine.yield()
end	
	
end)
_购买随机石 = coroutine.create(function ()
while (true) do
	if (_多点找色(FCBMP.快捷物品栏) and (_多点找色(FCBMP.随机石图标) == false)) then
			_点击(TBP.随机石)
	end
	coroutine.yield()
end	
	
end)


--万魔殿挂机
function _进入万魔殿(map,贵族等级,PK)
	
	--1.进入万魔殿地图
	if (_多点找色(FCBMP.万魔殿地图) == false) then
		
			--角色血量状态良好
			repeat
			local 角色血量状态 = _获取角色状态()
			mSleep(1000)
			_点击(TBP.恢复血量)
			until (角色血量状态 == 1)
			repeat
				if _多点找色(FCBMP.关闭角色面板) then
					_点击(TBP.关闭角色面板)
					mSleep(800)
				end
				_点击(TBP.挑战BOSS)
				mSleep(1500)
			until (_多点找色(FCBMP.挑战BOSS界面))
			_点击(TBP.进入万魔殿)
			mSleep(1500)
			--2.闭合活动按钮(影响锁定怪物)
			if (_多点找色(FCBMP.展开活动按钮)== false) then
				_点击(TBP.展开活动按钮)
			end

		else
				--2.闭合活动按钮(影响锁定怪物)
		if (_多点找色(FCBMP.展开活动按钮)== false) then
			_点击(TBP.展开活动按钮)
		end
		_延迟启动协程(map,贵族等级,PK)
		--3锁定当前屏幕怪
			if(_多点找色(FCBMP.锁定怪物) == false)then
				_延迟启动协程(map,贵族等级,PK,2)
				::FIND_GUAIWU::
				if(_多点找色(FCBMP.锁定怪物) == false and _多点找色(FCBMP.万魔殿地图))then
					_使用随机石()
					coroutine.resume(_自动战斗)
					mSleep(3000)
					goto FIND_GUAIWU
				end
			end
	
	end



end



function _半自动挂机(map,贵族等级)
		if (_多点找色(FCBMP.蓝月城) or _多点找色(FCBMP.青石城) or _多点找色(FCBMP.禁魔城))then
			_进入野外地图()
		else
			
			--2.闭合活动按钮(影响锁定怪物)
			if (_多点找色(FCBMP.展开活动按钮)== false) then
				_点击(TBP.展开活动按钮)
			end
			_延迟启动协程(map,贵族等级,PK)
		--3锁定当前屏幕怪
			if(_多点找色(FCBMP.锁定怪物) == false)then
				_延迟启动协程(map,贵族等级,PK,1)
				if(_多点找色(FCBMP.锁定怪物) == false)then
					_使用随机石()
				end
			end
			
			
			
			
			
		end
		

		
		
end

--贵族挂机
function _进入贵族挂机(map,贵族等级)
	--进入贵族挂机地图
while (true) do
	if (_多点找色(FCBMP.贵族专属挂机) == false) then
		_点击(TBP.挑战BOSS)
		mSleep(500)
		if _多点找色(FCBMP.挑战BOSS界面) then
			_点击(TBP.进入贵族挂机)
		end
	end
end

	
end



function _协程运行(map,贵族等级,PK)

	coroutine.resume(_玩家PK,PK)
	coroutine.resume(_背包满回收,map,贵族等级)
	if (PK == "1") then
		_点击(TBP.自动战斗)
	end
	coroutine.resume(_玩家PK,PK)
	coroutine.resume(_断线重连)
	coroutine.resume(_玩家PK,PK)
	coroutine.resume(_自动战斗)
	coroutine.resume(_玩家PK,PK)
	coroutine.resume(_行会心魔召唤)
	coroutine.resume(_玩家PK,PK)
	coroutine.resume(_角色换抗)
	coroutine.resume(_玩家PK,PK)
	coroutine.resume(_角色状态恢复)
	coroutine.resume(_玩家PK,PK)
	coroutine.resume(_购买回城石)
	coroutine.resume(_玩家PK,PK)
	coroutine.resume(_购买随机石)
	coroutine.resume(_玩家PK,PK)
	

end

--时间片调度
function _延迟启动协程(map,贵族等级,PK,delay)
	delay = delay or 0 --10秒
	local i = 0 
	while (true) do
		_协程运行(map,贵族等级,PK)
		if (i >= delay)then
			break
		end
		i = i + 1 
	end
end
function _游戏主线程(map,PK)
	PK = PK or "0"
	贵族等级 = _获取当前贵族等级()
	while (true) do
		
		if (map == 0) then
			--进入刷怪地图=>万魔殿
			_进入万魔殿(map,贵族等级,PK)
			
		elseif (map == 1)then
			--进入刷怪地图=>贵族地图
			if (贵族等级 >= 4 )then
				_进入贵族挂机(map,贵族等级)
			else
				dialog("贵族等级不足4,无法进入贵族地图")
				lua_exit()
			end
		else
			_半自动挂机(map,贵族等级,PK)
		end
	end
end	

function _玩家PK设置()
	_debug("你选择挂机时开启玩家PK！")
	if (_多点找色(FCBMP.玩家PK按钮) == false)then
		mSleep(800)
		_点击(TBP.个人设置面板)
		mSleep(800)
		if (_多点找色(FCBMP.玩家PK按钮设置打勾) == false)then
			_点击(TBP.玩家PK按钮设置打勾)
			mSleep(400)
			_点击(TBP.关闭个人设置面板)
		end
	end
end

function _启动辅助()

	ret, map,PK = showUI(MyJsonString)
if ret == 0 then
	lua_exit()
end	
	if (PK == "1")then
		_玩家PK设置()
	end
	
	if (map == "0")then
		_游戏主线程(0,PK) --万魔殿
	elseif (map == "1") then
		_游戏主线程(1) --贵族地图
	elseif (map == "2") then
		_游戏主线程(2,PK) --半自动野外刷图
	else
		dialog("暂未开启其他地图！", 0)
		lua_exit();
	end
end

--启动辅助
_初始化()
_启动辅助()









